## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.share_files_securely will be updated in-place
  ~ resource "aws_cloudfront_distribution" "share_files_securely" {
        id                             = "E2DT9JFRD8ZV5B"
        tags                           = {
            "CostCentre" = "share-files-securely"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)



      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "share-files-securely.s3.ca-central-1.amazonaws.com"
          + origin_id           = "share-files-securely-bucket"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }
      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "share-files-securely.s3.ca-central-1.amazonaws.com" -> null
          - origin_id           = "share-files-securely-bucket" -> null
        }


        # (6 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_identity.origin_access_identity will be created
  + resource "aws_cloudfront_origin_access_identity" "origin_access_identity" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "cloudfront origin access identity"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.share_files_securely_bucket.aws_s3_bucket.this,
  on .terraform/modules/share_files_securely_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects.aws_iam_role.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects_dev.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects_dev.aws_iam_role.s3_scan_object"]

28 tests, 17 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
